lxf13927043839/Stm32_code/bluetooth/USER/main.c
void SET_time(void)
{
	//注：有一些函数是初始化过了的，整合时候要删除
	
	u8 process=0;  //程序流程走向
	u8 option=6;     //调整时间选项
	u8 t=0,j;      //计时参数
	u8 time_set_flag=0;//是否设置了按键的定时标志
	u8 now_date_buff[40];//当前的日期
	u8 now_time_buff[40];//当前的时间

	u8 time_buff[40]={0};//存放定时的时间,没有初始化会出现一些意外的bug，如出现一斜杆
	u8 date_buff[40];//存放定时的日期
	u8 test[40];//从24c02 读取数据测试
	u8 curtain_status_choose_insettime=3;//选择窗帘状态,只有0/1 状态是有效的，其他数字是无效的
	short set_tim_success=-1; //时间的设置是正常的 
	u8 had_settimeflag=3; //检测是否有设置了
	u8 temp;
	u8 set_curtain_status;//定时设置窗帘的开关，不是直接反应窗帘状态,用来清理=3
	
	
	u8 set_time_successful=0;//0 ：未设置，1：设置成功
	
	BRUSH_COLOR=RED;
	
	//待删除部分
	/*
	LCD_DisplayString(10,10,24,"Illuminati STM32F4");	
	LCD_DisplayString(10,40,16,"Author:Clever");
	LCD_DisplayString(30,70,24,"14.RTC TEST");
	LCD_DisplayString(30,100,16,"KEY3 Long :Adjust time");
	LCD_DisplayString(30,120,16,"     Short:Adjust OK");
	LCD_DisplayString(30,140,16,"KEY0: V++  KEY1: V--");
	LCD_DisplayString(30,160,16,"KEY2: Right Move");
	*/
	RTC_GetTimes(RTC_Format_BIN);//获得系统的时间
	Time_Display(); //在底下进行的动态显示
	
	//显示界面
	image_display(0,0,(u8*)gImage_set_time);
	
	//判断之前是否有设置了定时
	AT24CXX_Read(4,&had_settimeflag,1);
	if(had_settimeflag==1||had_settimeflag==0)
	{
		//printf("正在画图\n");
		
		AT24CXX_Read(5,(u8 *)date_buff,10);
		delay_ms(100);
		AT24CXX_Read(15,(u8 *)time_buff,8);
		
		LCD_DisplayString_color(70,57,24,date_buff,BLUE,WHITE);
		LCD_DisplayString_color(70,81,24,time_buff,BLUE,WHITE);
		
		//printf("######################time_buff = %s \n",time_buff);
		set_time_successful=1;//不可以去选择开关了
		if(had_settimeflag==0)
		{
			LCD_DisplayChinese_one(110,108,25,24);
		}else if(had_settimeflag==1)
		{
			LCD_DisplayChinese_one(110,108,24,24);
		}
	}
	
  while(1) 
	{		
		key_scan_advanced(0);	
		t++;
		//add
		XPT2046_Scan(0);
		
		if(label_closetime==1)
		{
			goto close;
		}
		
		//返回
		if(Xdown>0&&Xdown<36&&Ydown>0&&Ydown<38)
		{
			delay_ms(200);
			enter_set_time=0;
			//printf("break successful\n");
			break;
		}
		//开
		if(Xdown>30&&Xdown<86&&Ydown>145&&Ydown<183)
		{
			delay_ms(200);
			
			if(set_time_successful==0)//还没有设置成功！还可以点击
			{
				LCD_DisplayChinese_one(110,108,24,24);
				curtain_status_choose_insettime=1;
			}
			
		}
		//关
		if(Xdown>154&&Xdown<210&&Ydown>145&&Ydown<183)
		{
			delay_ms(200);
			
			if(set_time_successful==0)//还没有设置成功！还可以点击
			{
				LCD_DisplayChinese_one(110,108,25,24);
				curtain_status_choose_insettime=0;
			}
			
		}
		//关闭/取消定时
		if(Xdown>197&&Xdown<240&&Ydown>0&&Ydown<43)
		{
			delay_ms(200);
close:			
			label_closetime=0;
			image_display(0,0,(u8*)gImage_set_time);
			process=0;
			set_curtain_status=3;
			//在添加上把at24c02里边的值清理干净
			AT24CXX_Write(4,(u8*)&set_curtain_status,1);
			has_set_time_online=0;//是否设置了定时，让rtc的秒中断实时去处理
			
			set_time_successful=0;//可以重新选择窗帘状态
			
			set_tim_success=0;//取消了设置，需要对设置定时成功的标志清一下
		}
		
		
		switch(process)
		{
			case 0:   // 流程0：时钟显示
			     {
						 if(key_tem==4&&key_time>250)//长按1.25秒，按键释放时，key_time自动设置0，见key.c
							{
								process=1;   //长按KEY3 进入调整时间流程
								break;
							}
						 if( ((t%50)==0) && (time_set_flag==0) )	//每250ms更新显示,并且没有定时
							{
								RTC_GetTimes(RTC_Format_BIN);//获取系统时间
								Time_Display();
							} 
						break;
			     }
			case 1:    // 流程1：调整时间
					{
					 if(keydown_data==KEY2_DATA) //按KEY2选项右移
					 {
							 option++;
							 if(option>5)   //循环
								 option=0;
					 }
					 					 
					 ADJUST_time(option,t);//调整时间函数
					 if(keydown_data==KEY3_DATA)
					 {
						 //Time_Display();// 防止在闪烁不显示的时候，短按KEY3确认调整后 显示空
						 //RTC_SetTimes(RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date,RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //RTC_GetTimes(RTC_Format_BIN);
						 //Time_Display();
						 

						 Time_has_set();//先显示用户设置的时间，在判断其合理性
						 
						 //存放设置的时间日期
						 sprintf((char*)date_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
						 //printf("%s  length = %d\n",date_buff,strlen(date_buff));
						 sprintf((char*)time_buff,"%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //printf("%s  length = %d\n",time_buff,strlen(time_buff));
						
						//获取当前的时间日期,更改了时间
						 RTC_GetTimes(RTC_Format_BIN);
						 
						 sprintf((char*)now_date_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
						 //printf("%s  length = %d\n",now_date_buff,strlen(now_date_buff));
						 sprintf((char*)now_time_buff,"%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //printf("%s  length = %d\n",now_time_buff,strlen(now_time_buff));
						 
						 
						 if(strcmp(date_buff,now_date_buff)>0)
						 {
								//printf("set date ok\n");	
								set_tim_success=1;
						 }
						 else if(strcmp(date_buff,now_date_buff)==0)
						 {
								if(strcmp(time_buff,now_time_buff)>0)
								{
									//printf("set time ok\n");
									set_tim_success=1;
								}
								else
								{
									//printf("set time no\n");
									LCD_DisplayString_color(30,280,24,"Please Reset time",BLUE,WHITE);
									for(j=0;j<200;j++) delay_ms(10);
									
									set_time_successful=0;//设置失败，可以重新选择窗帘状态
								}
						 }
						 else
						 {
								//printf("set date no\n");
								LCD_DisplayString_color(30,280,24,"Please Reset date",BLUE,WHITE);
							  for(j=0;j<200;j++) delay_ms(10);
							 
								set_time_successful=0;//设置失败，可以重新选择窗帘状态
						 }
						 
						 //设置的定时没有问题，再确认有选择窗帘开关，写入at24c02，时间比窗帘的开关更有必要
						 if(set_tim_success==1)
						 {
							 if(curtain_status_choose_insettime!=3)
							 {
									printf("set and choose ok，curtain_status= %d \n",curtain_status_choose_insettime);
									LCD_DisplayString_color(30,280,24,"Adjust TIM OK          ",BLUE,WHITE);
									//for(j=0;j<100;j++) delay_ms(10);  // Adjust OK 调整OK显示1秒
									//LCD_DisplayString(30,280,24,"                        ");
									
