lxf13927043839/Stm32_code/bluetooth/USER/main.c
								 /*
										定时ok，窗帘选择ok，接下来就要写进入到at24c02中
										例子：
								  //AT24CXX_Write(0,(u8*)date_buff,strlen(date_buff));
									//AT24CXX_Read(0,test,strlen(date_buff));
									//printf("test = %s\n",test);
								 */
									AT24CXX_Write(4,(u8*)&curtain_status_choose_insettime,1);
									//delay_ms(100);
								  //AT24CXX_Read(4,&temp,1);
									//printf("temp = %d \n",temp);
									
									AT24CXX_Write(5,(u8*)date_buff,strlen(date_buff));
									delay_ms(50);
									AT24CXX_Write(15,(u8*)time_buff,strlen(time_buff));
									delay_ms(50);
									
									AT24CXX_Read(5,set_time_buff,strlen(date_buff)+strlen(time_buff));
									
									//printf("test = %s\n",test);
									has_set_time_online=1;
									set_time_successful=1;//定时成功---不可以再去选择窗帘状态
									curtain_status_choose_insettime=3;//定时成功后，又想在同个界面重新定时，
																										
									set_tim_success=0;//防止继续设置，会导致设置成功，需要清零
									
								  option=0;    //选项从头来
									process=0;   //短按KEY3时间设置完成 返回到时间显示
									break;
								 
							 }
							 else
							 {
									LCD_DisplayString_color(0,280,24,"Please choose on/off",BLUE,WHITE);
									for(j=0;j<200;j++) delay_ms(10);
									image_display(0,0,(u8*)gImage_set_time);
							 }
						 }

						 
					 }
					break;
			   }
	  }
		delay_ms(5); //系统延时，也算是系统计时
	}	
}

/*
	功能：在00：00-06：00利用人体红外检测检测蜂鸣器警报
	用户开启后才起作用
*/
void beepalarm_in_night(void)
{
	int haspeople=0;
	haspeople=People_scan();
	if(haspeople==1)
	{
		
		if(beep_status==1)
		{
			//BEEP=1;
		  printf("beep is ringing\n");
		}
		
		data_buff[25]=5+48;
	}
	else
	{
		//BEEP=0;
		//printf("no people \n");
		data_buff[25]=0+48;
	}
}
//-*****************************************//


u8 light_control_valid;
//尽量最终程序减少不必要的打印

int main()
{
	int only_test=0;
	int people=0;
	int i=0,cycle=0,T=2048;
	int adcx;
	/*
		定义标志变量
		初始值都是-1
		在变量后边，对所赋值进行说明
	*/
	u8 status;

	u8 system_mode=0;//1:智能 0：手动
	int chinese_mode[3]={11,12,-1};//模式的名字:智能
	u8 light_status=0;//1:弱 2：中 3：强
	
	//test
	Systick_init(168);  //初始化延时函数，没有初始化会导致程序卡死
	
	BEEP_init();
	LED_init();
  KEY_init();
	EXTI_init( );
	
	
	UART1_init(115200);
	printf("reset ----\n");
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	
	AT24CXX_init(); 
	while(AT24CXX_Check())
	{
		printf("AT24CXX 检测失败\n");
  	LED0=!LED0;
	}
	
  //如果没有dht11 灯会闪烁，需解释出来
//	while(DHT11_init())
//	{
//		LED1=!LED1;
//	}
	
	People_init();
	
	//光敏   需解释出来，在更新数据部分也要解出来
	ADC_init();   
	adcx=Get_Adc_Average(ADC_Channel_9,20);//获取通道9的转换值，20次取平均
	light_streng_now=(4096-adcx)*100/4096;
	
	My_RTC_init();
	
	//在这里设置选择了ck_spre的时钟频率，即1HZ的频率
	//所有给0 会产生1S
	//可看寄存器的配置,10x是选择了ck_spre的时钟频率
	RTC_Set_WakeUp(RTC_WakeUpClock_CK_SPRE_16bits,0);//WAKE UP 
	
	
	TIM3_init(5*10000-1,8400-1);//定时器5秒检测开看门狗
	ESP8266_UART4_init(115200);
	WIFI_Server_Init();
	
	//ALL_SENSOR_init();
	LCD_init();  //初始化LCD FSMC接口和显示驱动
	
	Touch_Init();				//触摸屏的初始化
	
	printf("start \n");
	
	ELECTRI_motor_init();
	//先对24C02存储的值进行判断，先初始化一下，可以进行优化一下

	//光照阈值
	AT24CXX_Read(1,&status,1);
	if(status!=1&&status!=2&&status!=3)
	{
		status=1;
		AT24CXX_Write(1,&status,1);
	}
	//夜晚蜂鸣器
	AT24CXX_Read(2,&beep_status,1);
	if(beep_status!=0&&beep_status!=1)
	{
		beep_status=0;
		AT24CXX_Write(2,&beep_status,1);
	}
	//模式
	AT24CXX_Read(3,&status,1);
	if(status!=0&&status!=1)
	{
		status=0;
		AT24CXX_Write(3,&status,1);
	}
	

	while(1)
	{
		switch(status)
		{
			case 1://------------------------------智能模式--------------------
				light_control_valid=1;
				image_display(0,0,(u8*)gImage_smart_mode);
				LCD_showdate();//五秒刷新一次，到时候
			
				AT24CXX_Read(1,&light_status,1);
				if(light_status==1)//弱
				{
					LCD_DisplayChinese_one(167,148,21,24);
				}else if(light_status==2)//中
				{
					LCD_DisplayChinese_one(167,148,22,24);
				}else if(light_status==3)//强
				{
					LCD_DisplayChinese_one(167,148,23,24);
				}
			
				//窗帘状态----到时候会先去读取该值的
				if(curtain_status==0)
				{
					LCD_DisplayChinese_one(135,185,25,24);
				}
				else if(curtain_status==1)
				{
					LCD_DisplayChinese_one(135,185,24,24);
				}
				
				//显示模式
				chinese_mode[0]=11;
				chinese_mode[1]=12;
				LCD_DisplayChinese_string(135,223,24,chinese_mode);
			
				//夜晚蜂鸣器
				AT24CXX_Read(2,&beep_status,1);
				if(beep_status==0)
				{
					LCD_DisplayChinese_one(205,264,25,24);
				}
				else if(beep_status==1)
				{
					LCD_DisplayChinese_one(205,264,24,24);
				}
//---------------------------------------------------------------------			
				while(1)
				{
					XPT2046_Scan(0);
					//------------加光照阈值-------------
					if(Xdown>128&&Xdown<164&&Ydown>143&&Ydown<179)
					{
						delay_ms(200);
						
						light_status++;
						if(light_status>3)
						{
							light_status=1;
							LCD_DisplayChinese_one(167,148,21,24);
						}
						else
						{
							if(light_status==1)
							{
								LCD_DisplayChinese_one(167,148,21,24);
							}
							else if(light_status==2)
							{
								LCD_DisplayChinese_one(167,148,22,24);
							}
							else if(light_status==3)
							{
								LCD_DisplayChinese_one(167,148,23,24);
							}
						}
						
						AT24CXX_Write(1,&light_status,1);
						
					}
					//-------------减光照阈值-------------------
					if(Xdown>195&&Xdown<231&&Ydown>143&&Ydown<179)
					{
						delay_ms(200);
						
						light_status--;
						if(light_status<1)
						{
							light_status=3;
							LCD_DisplayChinese_one(167,148,23,24);
						}
						else
						{
							if(light_status==1)
							{
								LCD_DisplayChinese_one(167,148,21,24);
							}
							else if(light_status==2)
							{
								LCD_DisplayChinese_one(167,148,22,24);
							}
							else if(light_status==3)
							{
								LCD_DisplayChinese_one(167,148,23,24);
							}
						}
						AT24CXX_Write(1,&light_status,1);
					}
					
					if(label_mode==1)
					{
						goto smart_mode;
					}
					
					//切换模式
					if(Xdown>5&&Xdown<45&&Ydown>206&&Ydown<246)
					{
						
						delay_ms(200);
smart_mode:
						label_mode=0;
						status=0;
						
						system_mode=0;
						AT24CXX_Write(3,&system_mode,1);
						
						break;
					}
					//夜晚蜂鸣器
					if(Xdown>0&&Xdown<45&&Ydown>255&&Ydown<300)
					{
						delay_ms(200);
						
						if(beep_status==0)
						{
							LCD_DisplayChinese_one(205,264,24,24);
							beep_status=1;
							AT24CXX_Write(2,&beep_status,1);
						}
						else if(beep_status==1)
						{
							LCD_DisplayChinese_one(205,264,25,24);
							beep_status=0;
							AT24CXX_Write(2,&beep_status,1);
						}
						printf("蜂鸣器\n");
					}
					if(Zero_to_six_clock==1)
		 			{
						beepalarm_in_night();
					}
					else
					{
						data_buff[25]=0+48;
					}
//=================================================================================
					if(light_streng_now>light_streng_set)//光照强，关窗帘 light_streng_set会每十秒检测有没有改动
					{
						if(curtain_status==1&&light_control_valid==1)
						{
							close_rotate();
							curtain_status=0;
							LCD_DisplayChinese_one(135,185,25,24);
							printf("curtain close because light strength too high\n");
						}
					}
					else	//当前光照不强，打开窗帘
					{
						if(curtain_status==0&&light_control_valid==1)
						{
							open_rotate();
							curtain_status=1;
							LCD_DisplayChinese_one(135,185,24,24);
							printf("curtain open beacause light weak\n");
						}
					}
					
					
//===================================================================================					
					
					
