lxf13927043839/Stm32_code/bluetooth/USER/main.c
				}
				break;
			
			case 0://-------------------------手动-------------------------
				image_display(0,0,(u8*)gImage_hand_mode);
				LCD_showdate();
//-----------------------------------------------------------			
				//窗帘状态----到时候会先去读取该值的
				if(curtain_status==0)
				{
					LCD_DisplayChinese_one(140,143,25,24);
				}
				else if(curtain_status==1)
				{
					LCD_DisplayChinese_one(140,143,24,24);
				}
			
				
				//显示模式
				chinese_mode[0]=13;
				chinese_mode[1]=14;
				LCD_DisplayChinese_string(140,173,24,chinese_mode);
				
				
				//夜晚蜂鸣器
				AT24CXX_Read(2,&beep_status,1);
				if(beep_status==0)
				{
					LCD_DisplayChinese_one(205,264,25,24);
				}
				else if(beep_status==1)
				{
					LCD_DisplayChinese_one(205,264,24,24);
				}
//---------------------------------------------------------------------			
			
				while(1)
				{
					XPT2046_Scan(0);
					if(label_mode==1)
					{
						goto hand_mode;
					}
					//切换模式
					if(Xdown>0&&Xdown<40&&Ydown>168&&Ydown<208)
					{

						delay_ms(300);
hand_mode:
						label_mode=0;
						status=1;
					
						system_mode=1;
						AT24CXX_Write(3,&system_mode,1);
						//printf("switch \n");
						break;
					}
					
					//窗帘ON
					if(Xdown>100&&Xdown<143&&Ydown>203&&Ydown<245)
					{
						delay_ms(200);
						LCD_DisplayChinese_one(140,143,24,24);
						
						if(curtain_status==0)
						{
							curtain_status=1;
						//add 马上发送消息到服务器上，不要切太快
							get_all_status_data(data_buff);
							SENDstr_to_server(data_buff);
//=======================================================
							open_rotate();
							
							printf("curtain open from hand mode\n");
						}
						
						//printf("on \n");
					}
					
					//窗帘OFF
						if(Xdown>147&&Xdown<190&&Ydown>203&&Ydown<245)
					{
						delay_ms(200);
						LCD_DisplayChinese_one(140,143,25,24);
						
						if(curtain_status==1)
						{
							curtain_status=0;
							//add 马上发送消息到服务器上，不要切太快
							get_all_status_data(data_buff);
							SENDstr_to_server(data_buff);
//====================================================================	
							close_rotate();
							printf("curtain off by hand mode\n");
						}
						//printf("off \n");

					}
					
					//设置定时开关
					if(Xdown>190&&Xdown<230&&Ydown>226&&Ydown<266)
					{
						delay_ms(200);
						enter_set_time=1;
						SET_time();
						
						break;//重新进入手动模式，刷新界面
					}
					
					//夜晚蜂鸣器
					if(Xdown>0&&Xdown<45&&Ydown>255&&Ydown<300)
					{
						delay_ms(300);
						
						if(beep_status==0)
						{
							LCD_DisplayChinese_one(205,264,24,24);
							beep_status=1;
							AT24CXX_Write(2,&beep_status,1);
						}
						else if(beep_status==1)
						{
							LCD_DisplayChinese_one(205,264,25,24);
							beep_status=0;
							AT24CXX_Write(2,&beep_status,1);
						}
						//printf("蜂鸣器\n");
					}
					if(Zero_to_six_clock==1)
					{
						beepalarm_in_night();
					}
					else
					{
						data_buff[25]=0+48;
					}	
				}
				break;
		}
	}

}

